Table of Contents
 Class PointResults
Namespace
IdeaRS.OpenModel.Result
Assembly
IdeaRS.OpenModel.dll
Point results
[Obfuscation(Feature = "renaming")]
public class PointResults
Inheritance
object
PointResults
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 PointResults()
Constructor
public PointResults()
Properties
 Point
Point
public Point2D Point { get; set; }
Property Value
Point2D
 Results
List of results in the point
public List<PointResultBase> Results { get; set; }
Property Value
List<PointResultBase>
 Edit this page